//Написать игру камень ножницы бумага.
//Игра будет продолжаться до тех пор, пока игрок либо компьютер
//не наберет 5 побед.
//После завершения необходимо вывести общий счет и победителя
#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "");
	srand(time(NULL));
	int a, b, c = 0, d = 0;
	while ((c < 5 && d < 5)) {
		b = 1 + rand() % (3 + 1 - 1);
		cout << "Что вы выбираете: " << "\n";
		cout << "Камень - 1" << "\n";
		cout << "Ножницы - 2" << "\n";
		cout << "Бумага - 3" << "\n";
		cin >> a;
		if (a < 1 || a > 3) {
			cout << "Некорректный выбор";
			cout << "Что вы выбираете: " << "\n";
			cout << "Камень - 1" << "\n";
			cout << "Ножницы - 2" << "\n";
			cout << "Бумага - 3" << "\n";
			cin >> a;
		}
		if (a == 1 && b == 2) c++;
		if (a == 2 && b == 3) c++;
		if (a == 3 && b == 1) c++;
		if (a == 2 && b == 1) d++;
		if (a == 3 && b == 2) d++;
		if (a == 1 && b == 3) d++;
		cout << c << " вы " << d << " комп " << "\n";
		srand(time(NULL));
	}
	if (c == 5) cout << "Вы выиграли!";
	if (d == 5) cout << "Компьютер выиграл -_-";
}
